{
    "sections": {
        "main": {
            "type": "main-product",
            "blocks": {
                "acc_1": {
                    "type": "accordion",
                    "settings": {
                        "heading": "The Artisan's Journey",
                        "content": "<p>Every piece begins with a profound respect for the emotion it will carry.</p><p>Our artisans hand-select each preserved rose at its absolute peak—capturing its velvety texture and vibrant color forever.</p><p>The jewelry is forged from ethically sourced metals and brilliant stones, because a love built to last should never harm the earth.</p><p>From the final hand-polish to the precise assembly of our display vaults—every step is a labor of love, crafted to honor yours.</p>"
                    }
                },
                "acc_2": {
                    "type": "accordion",
                    "settings": {
                        "heading": "Materials & Care",
                        "content": "<p><strong>The Jewelry</strong></p><p>925 Sterling Silver · Stainless Steel · Hypoallergenic Copper<br>Finished in luxurious 14K Gold or Rhodium. Skin-safe by design.</p><p><em>Care:</em> Gently wipe with a soft microfiber cloth to maintain brilliance.</p><p><strong>The Eternal Blooms</strong></p><p>Zero maintenance. No water, no sunlight needed.</p><p>Keep them in their sanctuary box, away from harsh sunlight or extreme humidity—they'll retain their beauty for years.</p>"
                    }
                },
                "acc_3": {
                    "type": "accordion",
                    "settings": {
                        "heading": "How It Works",
                        "content": "<p>Gifting should be a cinematic experience—not just a transaction.</p><p>Your keepsake arrives impeccably packaged and completely ready to present.</p><p>Depending on your collection, the unboxing unfolds as a ritual: a smooth drawer gliding open, a dramatic double-door reveal, or a gentle rotation presenting the hidden jewelry beneath the bloom.</p><p>Write your truth on the included message card, present the box, and prepare for an unforgettable moment.</p>"
                    }
                },
                "acc_4": {
                    "type": "accordion",
                    "settings": {
                        "heading": "Are The Pieces Waterproof?",
                        "content": "<p>Our jewelry is highly durable and designed to anchor your everyday life.</p><p>While an occasional splash of water won't break the bond, we highly recommend removing your pieces before showering, swimming, or intense workouts.</p><p>Protecting them from prolonged exposure to moisture, perfumes, and lotions ensures the metallic finish and sparkling stones remain exactly as radiant as the day you gifted them.</p>"
                    }
                },
                "acc_5": {
                    "type": "accordion",
                    "settings": {
                        "heading": "Need Help Choosing The Right Size?",
                        "content": "<p>Take the guesswork out of gifting. We've designed our collections to be effortlessly universal.</p><p>Almost all of our necklaces feature a versatile \"clavicle chain\" design (typically 18 inches / 45cm) paired with a built-in 2-inch (5cm) extension loop. This allows the pendant to rest perfectly at her collarbone or be adjusted slightly lower, ensuring a flawless and comfortable fit for any silhouette.</p>"
                    }
                },
                "acc_6": {
                    "type": "accordion",
                    "settings": {
                        "heading": "Shipping Info",
                        "content": "<p><strong>Processing</strong></p><p>Your gift ships within 6 hours of ordering (excl. weekends & holidays), handled with the utmost care.</p><p><strong>Delivery Estimates</strong></p><ul><li>United States — 5–12 Business Days</li><li>UK &amp; EU — 5–12 Business Days</li><li>Australia &amp; NZ — 5–12 Business Days</li><li>Rest of World — 5–12 Business Days (est.)</li></ul><p>Exact shipping charges are calculated at checkout. We ship worldwide.</p><p><strong>Our Promise</strong></p><p>During peak gifting seasons, slight delays may occur. If there's any significant delay, our support team will contact you directly. Your peace of mind is our priority.</p>"
                    }
                }
            },
            "block_order": [
                "acc_1",
                "acc_2",
                "acc_3",
                "acc_4",
                "acc_5",
                "acc_6"
            ],
            "settings": {}
        },
        "ugc-videos": {
            "type": "ugc-videos",
            "settings": {
                "heading": "Celebrating 10,000+ Thrilled Girlfriends",
                "subtitle": "Real reactions. Real love. Real moments."
            }
        },
        "gift-memory": {
            "type": "gift-unique-memory",
            "settings": {
                "layout": "image_first",
                "image_asset": "gift-memory-image.jpg",
                "heading": "Gift a unique memory.",
                "text": "<p>Tired of giving the same generic, boring presents? It’s stressful trying to find something that actually holds <strong>real meaning.</strong></p><p>Surprise them with a handcrafted piece that perfectly captures exactly how you feel.</p><p><em>Give them a memory they can literally wear close to their heart, forever.</em></p>",
                "button_label": "SHOP NOW",
                "button_link": "shopify:\/\/collections\/bestsellers"
            }
        },
        "quality-warranty": {
            "type": "quality-warranty",
            "settings": {
                "heading": "Quality Backed By Our Warranty",
                "text": "<p>Every piece is meticulously crafted from sterling silver, available in both 14K gold and silver finishes. Designed with care to symbolize love and enduring elegance.</p><p>Our jewelry is hypoallergenic, lead-free, and nickel-free — ensuring safety and comfort for every wearer.</p><p>We back every piece with a <strong>lifetime warranty</strong>, because quality this profound deserves a promise to match. Our creations are made to turn moments into cherished memories.</p>"
            }
        },
        "makers-dedication": {
            "type": "makers-dedication",
            "settings": {}
        },
        "happy-customers": {
            "type": "happy-customers",
            "settings": {
                "subheading": "REAL STORIES",
                "heading": "Happy Customers",
                "subtitle": "See what our community has to say"
            }
        },
        "trust-and-stats": {
            "type": "trust-and-stats",
            "settings": {
                "heading": "Why Choose Heart To Soul?",
                "subtitle": "Crafted with love, backed by our promise.",
                "note": "Trusted by 10,000+ happy customers across the USA"
            }
        },
        "secure-checkout": {
            "type": "secure-checkout",
            "settings": {
                "subtitle": "Pay with confidence using any major payment method — powered by Shopify"
            }
        },
        "our-story": {
            "type": "our-story",
            "settings": {
                "subheading": "OUR STORY",
                "heading": "Heart To Soul",
                "text_left": "Every piece is meticulously assembled by skilled artisans. We pour our soul into every detail to ensure your gift is as perfect as the sacred love you share.",
                "text_right": "From selecting the finest materials to placing each piece in our signature rose box, every step is a labor of love — crafted to be the ultimate symbol of your devotion."
            }
        },
        "product-recommendations": {
            "type": "product-recommendations",
            "settings": {
                "subheading": "COMPLETE THE MOMENT",
                "heading": "You May Also Love"
            }
        }
    },
    "order": [
        "main",
        "ugc-videos",
        "gift-memory",
        "happy-customers",
        "quality-warranty",
        "makers-dedication",
        "product-recommendations",
        "our-story",
        "trust-and-stats",
        "secure-checkout"
    ]
}